tracker/app/controllers/application_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
    def authenticate_user
        token = request.headers['Authorization']&.split(' ')&.last
        decoded_token = JWT.decode(token, Rails.application.credentials.jwt_secret_key, true, { algorithm: 'HS256' })
        @current_user = User.find(decoded_token[0]['user_id'])