tracker/app/controllers/api/activities_controller.rb

      def create
        Activity.transaction do
          activity_params.each do |activity_data|
            # Attempt to find an existing activity
            activity = current_user.activities.find_by(url: activity_data[:url], date: activity_data[:date])

            if activity
              # If found, update the time spent
              activity.time_spent += activity_data[:time_spent]
            else
              # If not found, initialize a new activity with all necessary data
              activity = current_user.activities.new(activity_data)
            end

            # Save and handle failure
            unless activity.save
---
SELECT `activities`.* FROM `activities` WHERE `activities`.`user_id` = 1 AND `activities`.`url` = 'https://chatgpt.com/c/9a327992-f37a-486b-a1cb-bc217ecb4064' AND `activities`.`date` = '2024-05-12' LIMIT 1
INSERT INTO `activities` (`user_id`, `hostname`, `url`, `time_spent`, `created_at`, `updated_at`, `date`) VALUES (1, 'mail.google.com', 'https://mail.google.com/mail/u/0/#inbox', 82, '2024-05-12 17:10:53.095985', '2024-05-12 17:10:53.095985', '2024-05-12')
UPDATE `activities` SET `activities`.`time_spent` = 269, `activities`.`updated_at` = '2024-05-12 17:10:53.086572' WHERE `activities`.`id` = 51