tracker/app/controllers/api/restricted_sites_controller.rb

INSERT INTO `restricted_sites` (`hostname`, `user_id`, `created_at`, `updated_at`) VALUES ('www.instagram.com', 1, '2024-05-13 02:12:59.139463', '2024-05-13 02:12:59.139463')
---
    def create
      Rails.logger.debug "Restricted site hit with hostname: #{params[:hostname]}"
      restricted_site = current_user.restricted_sites.build(hostname: params[:hostname])
      if restricted_site.save