tracker/app/controllers/api/users_controller.rb

      def create
        existing_user = User.find_by(email: user_params[:email])
        if existing_user
          render json: { error: 'Email is already in use' }, status: :unprocessable_entity
        else
          user = User.new(user_params)
          if user.save
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'vishal.vaitla@gmail.com' LIMIT 1
INSERT INTO `users` (`email`, `password_digest`, `created_at`, `updated_at`) VALUES ('vishal.vaitla@gmail.com', '$2a$12$NwsPZP8aBToFOYbMmqfMFu4LSLftMSk.WuhMbH9ggLlpL8SOKNR.6', '2024-05-12 03:57:28.007444', '2024-05-12 03:57:28.007444')

      def login
        user = User.find_by(email: params[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'vishal.vaitla@gmail.com' LIMIT 1